# More Practice With SQL Queries - Lab

## Introduction

In this lesson, we'll run through some practice questions to refresh our knowledge of SQL Queries!

## Objectives

You will be able to:

- Practice your SQL knowledge

## Getting Started

As in previous labs, we'll make use of the `sqlite3` library as well as `pandas`. By combining them, we'll be able to write our queries as python strings, and make sure that the results are always returned as a pandas DataFrame. 

We'll start by loading both libraries and connecting to the database we'll be using for this lab, `data.sqlite`. You may remember this database from a previous lab. As a refresher, here's the ERD diagram for this database: 

<img src='images/Database-Schema.png'>

In the cell below:

* Import the necessary libraries `pandas` and `sqlite3`
* Establish a connection to the database `data.sqlite`
* Get the `cursor` from the connection and store it in the variable `c`.

In [5]:
import sqlite3
import pandas as pd
conn = sqlite3.Connection('data.sqlite')
c = conn.cursor()

## Basic Queries

Now, let's review basic SQL queries. In the cell below:

* Write a query that gets the first name, last name, phone number, address, and credit limit for all customers in California with a credit limit greater than 25000.00.

In [6]:
# For the first query, the boilerplate for getting 
#the query into a dataframe has been provided for you
c.execute("""select contactfirstname, contactlastname, phone, 
             addressline1, creditlimit
             from customers
             where cast(creditlimit as integer) > 25000""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,contactFirstName,contactLastName,phone,addressLine1,creditLimit
0,Jean,King,7025551838,8489 Strong St.,71800.0
1,Peter,Ferguson,03 9520 4555,636 St Kilda Road,117300.0
2,Janine,Labrune,40.67.8555,"67, rue des Cinquante Otages",118200.0
3,Jonas,Bergulfsen,07-98 9555,Erling Skakkes gate 78,81700.0
4,Susan,Nelson,4155551450,5677 Strong St.,210500.0
5,Roland,Keitel,+49 69 66 90 2555,Lyonerstr. 34,59700.0
6,Julie,Murphy,6505555787,5557 North Pendale Street,64600.0
7,Kwai,Lee,2125557818,897 Long Airport Avenue,114900.0
8,Diego,Freyre,(91) 555 94 44,"C/ Moralzarzal, 86",227600.0
9,Christina,Berglund,0921-12 3555,Berguvsvägen 8,53100.0
10,Jytte,Petersen,31 12 3555,Vinbæltet 34,83400.0
11,Mary,Saveley,78.32.5555,"2, rue du Commerce",123900.0
12,Eric,Natividad,+65 221 7555,Bronz Sok.,103800.0
13,Jeff,Young,2125557413,4092 Furth Circle,138500.0
14,Kelvin,Leong,2155551555,7586 Pompton St.,100600.0
15,Juri,Hashimoto,6505556809,9408 Furth Circle,84600.0
16,Wendy,Victorino,+65 224 1555,106 Linden Road Sandown,97900.0
17,Veysel,Oeztan,+47 2267 3215,Brehmen St. 121,96800.0
18,Martine,Rancé,20.16.1555,"184, chaussée de Tournai",82900.0
19,Marie,Bertrand,(1) 42.34.2555,"265, boulevard Charonne",84300.0
20,Jerry,Tseng,6175555555,4658 Baden Av.,43400.0
21,Julie,King,2035552570,25593 South Bay Ln.,84300.0
22,Mory,Kentary,+81 06 6342 5555,1-6-20 Dojima,81200.0
23,Michael,Frick,2125551500,2678 Kingston Rd.,76400.0
24,Matti,Karttunen,90-224 8555,Keskuskatu 45,96500.0
25,Rachel,Ashworth,(171) 555-1555,Fauntleroy Circus,136800.0
26,Dean,Cassidy,+353 1862 1555,25 Maiden Lane,69400.0
27,Elizabeth,Devon,(171) 555-2282,"12, Berkeley Gardens Blvd",92700.0
28,Yoshi,Tamuri,(604) 555-3392,1900 Oak St.,90300.0
29,Miguel,Barajas,6175557555,7635 Spinnaker Dr.,68700.0
...,...,...,...,...,...
64,Paul,Henriot,26.47.1555,59 rue de l'Abbaye,81100.0
65,Wales,MacKinlay,64-9-3763555,199 Great North Road,77700.0
66,Juri,Yoshido,6175559555,8616 Spinnaker Dr.,41900.0
67,Dorothy,Young,6035558647,2304 Long Airport Avenue,114200.0
68,Allen,Nelson,6175558555,7825 Douglas Av.,70700.0
69,Georg,Pipps,6562-9555,Geislweg 14,71700.0
70,Arnold,Cruz,+63 2 555 3587,15 McCallum Street,81500.0
71,Maurizio,Moroni,0522-556555,Strada Provinciale 124,121400.0
72,Akiko,Shimamura,+81 3 3584 0555,2-2-8 Roppongi,94400.0
73,Dominique,Perrier,(1) 47.55.6555,"25, rue Lauriston",95000.0
74,Sarah,McRoy,04 499 9555,101 Lambton Quay,86800.0
75,Michael,Donnermeyer,+49 89 61 08 9555,Hansastr. 15,77000.0
76,Maria,Hernandez,2125558493,5905 Pompton St.,67500.0
77,Dan,Lewis,2035554407,2440 Pompton St.,49700.0
78,Martha,Larsson,0695-34 6555,Åkergatan 24,116400.0
79,Sue,Frick,4085553659,3086 Ingle Ln.,77600.0
80,Roland,Mendel,7675-3555,Kirchgasse 6,45300.0
81,Leslie,Murphy,2035559545,567 North Pendale Street,95400.0
82,Yu,Choi,2125551957,5290 North Pendale Street,39800.0
83,Martín,Sommer,(91) 555 22 82,"C/ Araquil, 67",104600.0
84,Violeta,Benitez,5085552555,1785 First Street,85800.0
85,Sean,Clenahan,61-9-3844-6555,7 Allen Street,60300.0
86,Franco,Ricotti,+39 022515555,20093 Cologno Monzese,34800.0
87,Steve,Thompson,3105553722,3675 Furth Circle,55400.0
88,José Pedro,Roel,(95) 555 82 82,"C/ Romero, 33",65700.0
89,Rosa,Salazar,2155559857,11328 Douglas Av.,72600.0
90,Sue,Taylor,4155554312,2793 Furth Circle,60300.0
91,Thomas,Smith,(171) 555-7555,120 Hanover Sq.,43300.0
92,Valarie,Franco,6175552555,6251 Ingle Ln.,85100.0
93,Tony,Snowden,+64 9 5555500,Arenales 1938 3'A',110000.0

#### Expected Output

<img src='images/expected-output-1.png'>

## Aggregate Functions and GROUP BY

Next, write a query that get sthe average credit limit per state.

In [7]:
c.execute("""select avg(creditlimit), state
             from customers
             group by state""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

    avg(creditlimit)          state
0       61839.726027
1       89950.000000             BC
2       83854.545455             CA
3       57350.000000             CT
4           0.000000       Co. Cork
5       93900.000000  Isle of Wight
6       70755.555556             MA
7      114200.000000             NH
8       43000.000000             NJ
9      100550.000000            NSW
10      71800.000000             NV
11      89966.666667             NY
12      81200.000000          Osaka
13      84766.666667             PA
14          0.000000       Pretoria
15      51600.000000     Queensland
16      48700.000000         Québec
17      94400.000000          Tokyo
18      88800.000000       Victoria

#### Expected Output

<img src='images/expected-output-2.png'>

## JOINs

Now, write a query that uses JOIN statements to get the customer name, customer number, order number, status, and quantity ordered. Print only the head of this DataFrame.

In [8]:
c.execute("""select contactfirstname, contactlastname, phone, 
             ordernumber, status, quantityordered
             from customers
             join orders using(customernumber)
             join orderdetails using(ordernumber)""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

,contactFirstName,contactLastName,phone,orderNumber,status,quantityOrdered
0,Dorothy,Young,6035558647,10100,Shipped,22
1,Dorothy,Young,6035558647,10100,Shipped,30
2,Dorothy,Young,6035558647,10100,Shipped,49
3,Dorothy,Young,6035558647,10100,Shipped,50
4,Roland,Keitel,+49 69 66 90 2555,10101,Shipped,25

#### Expected Output

<img src='images/joins.png'>

## HAVING and ORDER BY

Now, return the customerName, customrerNumber, productName, productCode and total number ordered for any product a customer has bought 10 or more of cumulatively. Sort the rows in descending order by the quantity ordered. 

**_Hint_**: For this one, you'll need to make use of HAVING, GROUP BY, and ORDER BY--make sure you get the order of them correct!

In [9]:
c.execute("""select contactfirstname, contactlastname,
             productname, productCode, sum(quantityordered)
             from customers
             join orders using(customernumber)
             join orderdetails using(ordernumber)
             join products using(productcode)
             group by productcode
             having sum(quantityordered) > 10
             order by sum(quantityordered) desc""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

,contactFirstName,contactLastName,productName,productCode,sum(quantityordered)
0,Janine,Labrune,1992 Ferrari 360 Spider red,S18_3232,1808
1,Kelvin,Leong,1937 Lincoln Berline,S18_1342,1111
2,Maurizio,Moroni,American Airlines: MD-11S,S700_4002,1085
3,Sean,Clenahan,1941 Chevrolet Special Deluxe Cabriolet,S18_3856,1076
4,Maurizio,Moroni,1930 Buick Marquette Phaeton,S50_1341,1074

#### Expected Output

<img src='images/having_order.png'>

## Subqueries

Finally, get the first name, last name, employee number, and office code for employees from an office with less than 5 employees.

In [10]:
c.execute("""select firstname, lastname,
             employeenumber, officecode
             from employees
             where officecode in
             (select officecode, employeenumber 
             from offices 
             join employees using(officecode)
             where count(employeenumber)<5)""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

OperationalError: a GROUP BY clause is required before HAVING

#### Expected Output

<img src='images/expected-output-5.png'>

# Summary

In this lesson, we reviewed all the major concepts and keywords associated with SQL queries!